org/jpacheco.xyz.org
#+title: jpachecoxyz.github.io
#+author: Javier Pacheco
#+description: My website wrapped in an org file.
#+hugo_base_dir: ../
#+startup: content
#+hugo_custom_front_matter: toc true
#+hugo_auto_set_lastmod: nil
#+date: 2024-07-04
#+tags: blog(b) emacs(e) linux(l) personal(p) script(s) tecnology(t) wayland(w) work(W)
#+seq_todo: TODO(t) WAIT(w@/!) | DONE(d!)

** DONE Back to Void Linux                                  :blog:tecnology:
CLOSED: [2025-02-08 Sat 18:57]
:PROPERTIES:
:EXPORT_FILE_NAME: back-to-void-linux
:EXPORT_DESCRIPTION: After a while I decided to return to the begining
:DATE: [2025-01-26 Sun]
:EXPORT_HUGO_SECTION: posts
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-02-08 Sat 18:57]
:END:

*** Always return to the place that you where happy.

A long time ago (actually no more than 2 years) I was using =void linux=, it was a very good time, but for some reasons I change it for =venom linux=, =nixOS=, =guix linux= and others, to testing and learning within those linux distributions, but I always have a lack of something...

As much I like and enjoy =nixOS=, I always have problems, specially with the libraries and includes directories. I know that was only a small thing, but you know...

Guix was very interesting too, but same history as in nix. 

Venom linux was a such great too, amazing distro, excellent administrators. But I don't have the time to being compiling things, or fixing some issues within an update.

*** Conclusions.
So for that I will try =void-linux= again. I installed it again, the installation was smoothly, I use my [[https://github.com/jpachecoxyz/voidstrap][script]], so I install it very fast, and now I'm now in this amazing distro, I think that I'm going to be here at least a few years, because this distro its minimal, the community is amazing, and of course the stability is great. I encourage you to at least try void or some variants, it's just amazing.


