content/posts/back-to-void-linux.md
+++
title = "Back to Void Linux"
author = ["Javier Pacheco"]
description = "After a while I decided to return to the begining"
date = 2025-02-08T18:57:00-06:00
tags = ["blog", "tecnology"]
draft = false
toc = true
+++

## Always return to the place that you where happy. {#always-return-to-the-place-that-you-where-happy-dot}

A long time ago (actually no more than 2 years) I was using `void linux`, it was a very good time, but for some reasons I change it for `venom linux`, `nixOS`, `guix linux` and others, to testing and learning within those linux distributions, but I always have a lack of something...

As much I like and enjoy `nixOS`, I always have problems, specially with the libraries and includes directories. I know that was only a small thing, but you know...

Guix was very interesting too, but same history as in nix.

Venom linux was a such great too, amazing distro, excellent administrators. But I don't have the time to being compiling things, or fixing some issues within an update.


## Conclusions. {#conclusions-dot}

So for that I will try `void-linux` again. I installed it again, the installation was smoothly, I use my [script](https://github.com/jpachecoxyz/voidstrap), so I install it very fast, and now I'm now in this amazing distro, I think that I'm going to be here at least a few years, because this distro its minimal, the community is amazing, and of course the stability is great. I encourage you to at least try void or some variants, it's just amazing.
